app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "description", "name", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 07 Feb 2014 15:40:46 UTC +00:00], ["description", "Procesador i7 3Q\r\n"], ["name", "Notebook"], ["uid", "1234"], ["updated_at", Fri, 07 Feb 2014 15:40:46 UTC +00:00]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "uid" = ?, "name" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = 4  [["uid", "4587"], ["name", "Mesa"], ["description", "4 patas"], ["updated_at", Mon, 10 Feb 2014 01:42:15 UTC +00:00]]