app/controllers/taxes_controller.rb

SELECT "taxes".* FROM "taxes"
---
  def index
    @taxes = Tax.all

INSERT INTO "taxes" ("created_at", "name", "updated_at", "value") VALUES (?, ?, ?, ?)  [["created_at", Mon, 10 Feb 2014 16:31:49 UTC +00:00], ["name", "Impuesto por gil"], ["updated_at", Mon, 10 Feb 2014 16:31:49 UTC +00:00], ["value", 15]]
---
  def create
    @tax = Tax.new(tax_params)

    respond_to do |format|
      if @tax.save

SELECT "taxes".* FROM "taxes" WHERE "taxes"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_tax
      @tax = Tax.find(params[:id])