app/views/products/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category_id, "Category" %><br>
    <%= f.select :category_id, Category.all.map{|c| [c.name, c.id] }, { include_blank: true } %>